<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#In-a-business-setting,-most-data-may-not-be-stored-in-text-or-Excel-files." data-toc-modified-id="In-a-business-setting,-most-data-may-not-be-stored-in-text-or-Excel-files.-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>In a business setting, most data may not be stored in text or Excel files.</a></span></li></ul></div>

# 6.4 Interacting with Databases
### In a business setting, most data may not be stored in text or Excel files. 
* SQL-based relational databases (such as SQL Server, PostgreSQL, and MySQL) are in wide use, and many alternative databases have become quite popular. 
* The choice of database is usually dependent on the performance, data integrity, and scalability needs of an application.

In [7]:
import pandas as pd
import numpy as np

In [1]:
import sqlite3

query = """
 CREATE TABLE test
 (a VARCHAR(20), b VARCHAR(20),
 c REAL, d INTEGER
 );"""

con = sqlite3.connect('mydata.sqlite')
con.execute(query)

In [2]:
con.commit()

Then, insert a few rows of data:

In [3]:
data = [('Atlanta', 'Georgia', 1.25, 6),('Tallahassee', 'Florida', 2.6, 3),\
        ('Sacramento', 'California', 1.7, 5)]
stmt = "INSERT INTO test VALUES(?, ?, ?, ?)"
con.executemany(stmt, data)
con.commit()

Most Python SQL drivers (`PyODBC`, `psycopg2`, `MySQLdb`, `pymssql`, etc.) return a list of tuples when selecting data from a table:

In [4]:
cursor = con.execute('select * from test')
rows = cursor.fetchall()
rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

You can pass the list of tuples to the DataFrame constructor, but you also need the column names, contained in the cursorâ€™s description attribute:

In [5]:
cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [8]:
pd.DataFrame(rows, columns=[x[0] for x in cursor.description])

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5

* The `SQLAlchemy` project is a popular Python SQL toolkit that abstracts away many of the common differences between SQL databases. 
* pandas has a `read_sql` function that enables you to read data easily from a general `SQLAlchemy` connection.

In [9]:
import sqlalchemy as sqla
db = sqla.create_engine('sqlite:///mydata.sqlite')
pd.read_sql('select * from test', db)

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5